In [1]:
import numpy as np
import pandas as pd
#%matplotlib notebook
%matplotlib inline

import the dataset into a dataframe

In [3]:
df=pd.read_csv("Salaries.csv")
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

display the column names

In [4]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

display the number of rows and cols

In [5]:
df.shape

(148654, 13)

display the dataframe info (types of data in columns and not null values etc.)

In [6]:
df.info

<bound method DataFrame.info of             Id       EmployeeName  \
0            1     NATHANIEL FORD
1            2       GARY JIMENEZ
2            3     ALBERT PARDINI
3            4  CHRISTOPHER CHONG
4            5    PATRICK GARDNER
...        ...                ...
148649  148650      Roy I Tillery
148650  148651       Not provided
148651  148652       Not provided
148652  148653       Not provided
148653  148654          Joe Lopez

                                              JobTitle    BasePay  \
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  167411.18
1                      CAPTAIN III (POLICE DEPARTMENT)  155966.02
2                      CAPTAIN III (POLICE DEPARTMENT)  212739.13
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC   77916.00
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)  134401.60
...                                                ...        ...
148649                                       Custodian       0.00
148650                                    Not provided        NaN
148651                                    Not provided        NaN
148652                                    Not provided        NaN
148653                      Counselor, Log Cabin Ranch       0.00

        OvertimePay   OtherPay  Benefits   TotalPay  TotalPayBenefits  Year  \
0              0.00  400184.25       NaN  567595.43         567595.43  2011
1         245131.88  137811.38       NaN  538909.28         538909.28  2011
2         106088.18   16452.60       NaN  335279.91         335279.91  2011
3          56120.71  198306.90       NaN  332343.61         332343.61  2011
4           9737.00  182234.59       NaN  326373.19         326373.19  2011
...             ...        ...       ...        ...               ...   ...
148649         0.00       0.00       0.0       0.00              0.00  2014
148650          NaN        NaN       NaN       0.00              0.00  2014
148651          NaN        NaN       NaN       0.00              0.00  2014
148652          NaN        NaN       NaN       0.00              0.00  2014
148653         0.00    -618.13       0.0    -618.13           -618.13  2014

        Notes         Agency  Status
0         NaN  San Francisco     NaN
1         NaN  San Francisco     NaN
2         NaN  San Francisco     NaN
3         NaN  San Francisco     NaN
4         NaN  San Francisco     NaN
...       ...            ...     ...
148649    NaN  San Francisco     NaN
148650    NaN  San Francisco     NaN
148651    NaN  San Francisco     NaN
148652    NaN  San Francisco     NaN
148653    NaN  San Francisco     NaN

[148654 rows x 13 columns]>

display stats of the dataframe like count, mean, std, max, 25% etc.....

In [8]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

display null values per column

In [9]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

remove columns will all values as NaN

In [12]:
df.drop(['Notes','Status'], axis = 1,inplace=True) 
df.isnull().sum()

Id                      0
EmployeeName            0
JobTitle                0
BasePay               609
OvertimePay             4
OtherPay                4
Benefits            36163
TotalPay                0
TotalPayBenefits        0
Year                    0
Agency                  0
dtype: int64

display number of unique values in each column

In [15]:
uniqueValues = df.nunique()
uniqueValues

Id                  148654
EmployeeName        110811
JobTitle              2159
BasePay             109489
OvertimePay          65998
OtherPay             83225
Benefits             98465
TotalPay            138486
TotalPayBenefits    142098
Year                     4
Agency                   1
dtype: int64

mean of total pay of all people based on year

In [25]:
g1 = df.groupby( ['EmployeeName','Year'] )
g1['EmployeeName','TotalPay'].mean()

C:\Users\user\Anaconda3\envs\Cognifront\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

                            TotalPay
EmployeeName          Year
A BERNARD FATOOH      2011  20039.91
A Bernard  Fatooh     2013  23923.62
A Bernard Fatooh      2012  18500.19
                      2014  24061.35
A ELIZABETH MARCHASIN 2011  26282.86
...                              ...
Zuna T Luu            2013  56155.44
                      2014  56087.91
Zuri  Jones           2013  71986.90
Zuri Jones            2012  86588.52
                      2014  66667.54

[141061 rows x 1 columns]

how many people have 0 overtime pay

In [48]:
"""((df['OvertimePay']==0))
cnt = df.apply(lambda x: True if x['OvertimePay'] ==0 else False , axis=1)
numOfRows = len(cnt[cnt == True].index)
print("No of People having 0 overtime pay : ",numOfRows)"""
df1=df[df.OvertimePay == 0].reset_index(drop=True)
df1['EmployeeName'].count()

77321

max, min, mean, median and other stats of TotalPay of people having 0 OvertimePay

In [56]:
df1.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,77321.000000,76720.000000,77321.0,77321.000000,58342.000000,77321.000000,77321.000000,77321.000000
mean,77093.868897,59052.468386,0.0,1635.883031,21193.423915,60229.348901,76220.693271,2012.513237
std,42958.288642,47958.028112,0.0,6284.754666,17468.225890,49307.912350,63310.245056,1.115316
min,1.000000,0.000000,0.0,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000
25%,36919.000000,12999.755000,0.0,0.000000,1202.945000,13290.450000,14463.370000,2012.000000
50%,74157.000000,57273.055000,0.0,50.000000,25547.840000,58158.590000,73155.890000,2013.000000
75%,110772.000000,89826.697500,0.0,1065.010000,33957.787500,91115.090000,117157.260000,2014.000000
max,148654.000000,319275.010000,0.0,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000

find Id of that person with max TotalPay you got in previous question

In [69]:
highest_paid = df1.loc[df1['TotalPay'].idxmax()]
highest_paid['Id']

1

name of employee with total pay benefits = 87619.78

In [73]:
df2=df[df.TotalPayBenefits == 87619.78]
df2[['EmployeeName']]

       EmployeeName
12345  REBECCA CHIU

how many people have BasePay > 150000 and OvertimePay > 100000

In [87]:
df3=df[df.OvertimePay > 100000 ]
df3=df3[df3['BasePay'] > 150000 ]
df3['EmployeeName'].count()

12

which job title generally has highest average TotalPayBenefits

In [96]:
job = df.loc[df['TotalPayBenefits'].idxmax()]
job['JobTitle']

'GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY'

How many employees are POLICE

In [102]:
def chief_string(title):
    if 'POLICE' in title.split():
        return True
    else:
        return False

In [103]:
sum(df['JobTitle'].apply(lambda x:chief_string(x)))

1845